Tekla Open API Reference for Tekla Structures 2025
IHasChildren.GetObjects Method
 Gets the children of the current object.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
DrawingObjectEnumerator GetObjects()
Function GetObjects As DrawingObjectEnumerator
Return Value
Type: DrawingObjectEnumerator
The children of the current object.
See Also
Reference
IHasChildren Interface
GetObjects Overload
Tekla.Structures.Drawing Namespace